Repository: ned0emo/Simple-randomizer-SoC
Catalog: Simple randomizer SoC/Language/*_local.resx
Languages: ru

# uiReplacement
source: Replace interface elements
ru: Заменять элементы интерфейса

# weaponEverywhere
source: The opportunity to get weapons in the bar, in the scientists' bunker and at Sidorovich's
ru: Возможность достать оружие в баре, в бункере ученых и у Сидоровича

# weaponGuide
source: List of weapons and cartridges used: It is used to add weapons to caches, issue weapons to NPCs and to generate an assortment of merchants. The type of cartridges is necessary to add to the NPCs so that the people have ammunition to recharge. List of cartridges and quantities in one pack: It is used to add cartridges to caches. The number of cartridges in a pack is necessary to eliminate the imbalance between the generations of different types of cartridges So, if you generate cleanly in the range from 1 to 100, you can get 80 RPG rockets and 3 9x18 cartridges Generation by bundles (1 for rocket, 20 for 9x18, etc.) fixes this problem. It is necessary to separate cartridges with a quantity by a single space. Lists of sounds of shooting and reloading - everything is clear Lists from this tab are NOT used to generate weapon stats. Weapon stats are read and changed in their *.ltx files in the directory ./data/gamedata/config/weapons
ru: Список оружия и используемых патронов: Используется для добавления оружия в тайники, выдаче оружия НПС и для генерации ассортимента торговцев. Тип патронов необходим для добавления к НПС, чтоб челы имели боеприпас для перезарядки. Список патронов и количества в одной пачке: Используется для добавления патронов в тайники. Количество патронов в пачке необходимо для устранения дисбаланса между генераций разных типов патронов Так, если генерировать чисто в диапазоне от 1 до 100, можно получить 80 ракет от РПГ и 3 патрона 9х18 Генерация по пачкам (1 для ракеты, 20 для 9х18 и т. д.) исправляет эту проблему. Разделять патроны с количеством необходимо одиночным пробелом. Списки звуков стрельбы и перезарядки - все понятно Списки с данной вкладки НЕ используются для генерации статов оружия. Статы оружия считываются и изменяются в своих *.ltx файлах в директории ./rndata/gamedata/config/weapons

# weaponListTitle
source: Weapons and cartridges used by them
ru: Оружие и используемые им патроны

# weaponsDataError
source: The data for generating weapons were not received. An "updateData" call is required
ru: Данные для генерации оружия не были получены. Требуется вызов "updateData"

# weaponsError
source: Weapon generation error. Operation aborted
ru: Ошибка генерации оружия. Операция прервана

# weaponsTab
source: Weapon
ru: Оружие

# weatherDataError
source: Data for weather generation was not received. Operation aborted
ru: Данные для генерации погоды не были получены. Операция прервана

# weatherError
source: Weather generation error. Operation aborted
ru: Ошибка генерации погоды. Операция прервана

# weatherHelp
source: A change in the weather mainly affects the color of the environment, therefore it may not be very pleasant. But the game will complement the RGB gaming keyboard and mouse well
ru: Изменение погоды в основном затрагивает цвет окружения, потому может быть не очень приятным. Зато игра будет хорошо дополнять RGB геймерские клавиатуру и мышь

# weatherTab
source: Weather
ru: Погода

# whatGenerate
source: What to generate:
ru: Что генерировать:

# writeHandleError
source: Writing or processing error
ru: Ошибка записи или обработки
