Repository: ned0emo/Simple-randomizer-SoC
Catalog: Simple randomizer SoC/Language/*_local.resx
Languages: ru

# advancedParamsError
source: Error applying additional parameters
ru: Ошибка применения дополнительных параметров

# advancedTab
source: Advanced
ru: Дополнительно

# advancedText
source: The program can theoretically be used with some small mods (if the mod does not violate the logic of the original game files). To work with the mod, you need in the folder./rndata/gamedata/config in the gameplay, misc, weathers, and weapons directories, replace the necessary files with modified ones (if necessary, make a backup copy of the original files). After that, you should adjust the lists according to the content of the mod. If there are additional models and NPC voice acting in the modification, you just need to write down the paths to them in the lists by analogy with how the original models / voice acting are written. The files themselves don't need to be copied anywhere. The options on this tab are highly likely to not work with other mods. When activating these parameters, pre-edited game files are copied, which, if replaced, may break the mod.
ru: Программа теоретически может быть использована со многими модами (Если мод не нарушает логику оригинальных игровых файлов). Для работы с модом нужно в папке ./rndata/gamedata/config в директориях gameplay, misc, weathers и weapons заменить нужные файлы на модифицированные (при необходимости сделайте резервную копию оригинальных файлов). После чего следует поправить списки в соответствии с содержимым мода. Если в модификации есть дополнительные модели и озвучка НПС, нужно просто прописать пути к ним списках по аналогии с тем, как прописаны оригинальные модели/озвучка. Сами файлы копировать никуда не надо Параметры на данной вкладке с большой вероятностью не будут работать с другими модами. При активации данных параметров копируются заранее отредактированные игровые файлы, которые, в случае замены модифицированных, могут поломать мод.

# ammoListTitle
source: Cartridges and its num. in a pack
ru: Патроны и кол-во их в пачке

source: Artefacts
ru: Артефакты

# artefactsDataError
source: The path for saving artifacts is not specified. An "updateData" call is required
ru: Путь для сохранения артефактов не указан. Требуется вызов "updateData"

# artefactsError
source: Artifact generation error. Operation aborted
ru: Ошибка генерации артефактов. Операция прервана

# barAlarm
source: Disable the alarm in the Bar when a player kills someone
ru: Отключить тревогу в Баре, когда игрок кого-то убивает

# caches
source: Stashes
ru: Тайники

# cachesDataError
source: Data for generating caches was not received. An "updateData" call is required
ru: Данные для генерации тайников не были получены. Требуется вызов "updateData"

# cachesError
source: Error generating caches. Operation aborted
ru: Ошибка генерации тайников. Операция прервана

source: Cancel
ru: Отмена

# changeCommunity
source: Change the grouping of NPCs
ru: Изменять группировку НПС

# communityListTitle
source: Groupings
ru: Группировки

# consumableListTitle
source: Consumables
ru: Расходники

source: Consumables
ru: Расходники

# consumablesDataError
source: Data for consumables generation was not received. Operation aborted
ru: Данные для генерации расходников не были получены. Операция прервана

# consumablesError
source: Consumables generation error. Operation aborted
ru: Ошибка генерации расходников. Операция прервана

source: Copy error
ru: Ошибка копирования

# deathItems
source: Items of killed NPCs
ru: Вещи убитых

# deathItemsDataError
source: The path to save the files of the items of the killed NPCs was not obtained. An "updateData" call is required
ru: Путь для сохранения файлов вещей убитых не был получен. Требуется вызов "updateData"

# deathItemsError
source: Error generating items of killed NPCs. Operation aborted
ru: Ошибка генерации вещей убитых. Операция прервана

source: Default lists
ru: Списки по умолчанию

source: Dialogs
ru: Диалоги

# dialogsDataError
source: The dialog generation data has not been uploaded. Operation aborted
ru: Данные для генерации диалогов не загружены. Операция прервана

# dialogsDescription
source: Changing the dialogues completely breaks the plot and most of the quests, so it is recommended to enable unlocking Sidorovich's door from the start of the game and give the main character a knife (the "Advanced" tab). By default, the lists of broken infos/actions contain infos/actions that cause the game to crash or the interface to freeze. However, they can record any other infos/actions that you want to exclude from generation. XML tags for infos are has_info, dont_has_info, and give_info. The XML tag for actions is action. If you want to mix the dialogs of a mod, then the dialog files should be placed in the rndata/gameplay_dialogs folder. At the same time, make sure that each file has only one XML tag in its root.
ru: Изменение диалогов полностью ломает сюжет и большинство квестов, потому рекомендуется включить разблокировку двери у Сидоровича со старта игры и дать главному герою нож (вкладка "Дополнительно")

# dialogsError
source: Dialog generation error. Operation aborted
ru: Ошибка генерации диалогов. Операция прервана

# epilepsy
source: It is not recommended to turn it on if you have ever had epileptic seizures
ru: Не рекомендуется включать, если у вас когда-либо были эпилептические приступы

source: Error
ru: Ошибка

# exceptionListTitle
source: Exceptions
ru: Исключения

# exiting
source: Completion...
ru: Завершение...

# fileCopying
source: Copying files...
ru: Копирование файлов...

# freedomAgression
source: Disable the hostility of the Freedom base if there are NPCs hostile to the player on it
ru: Отключить враждебность базы Свободы при наличии на ней НПС, враждебных к ГГ

# funnyTranslate
source: Funny russian translation
ru: Охлаждающий трахание перевод

# gameSounds
source: Sounds
ru: Звуки

source: Generate
ru: Сгенерировать

# generateNameOnlyCheckBox
source: Use only GENERATE_NAME
ru: Использовать только GENERATE_NAME

# gScriptFix
source: Fix (possible, but not all) crashes during a long game at late locations
ru: Фикс (возможных, но не всех) вылетов при долгой игре на поздних локациях

# guideFormName
source: Help
ru: Справка

# iconListTitle
source: Miniatures
ru: Миниатюры

# incorrectActions
source: Broken actions
ru: Сломанные действия

# incorrectInfos
source: Broken infos
ru: Сломанные события

# infoFornName
source: Warning
ru: Внимание

# ItemsGuide
source: All lists on this tab are used to add items to caches and to edit the assortment of merchants. Armor and artifact stats are generated in the files "outfit.ltx" and "artefacts.ltx" (directory ./rndata/gamedata/config/misc) and does not depend on these lists Rules for generating items in caches. Number of items from 1 to 7 (Each item is selected randomly and can be repeated) Probability of generating an item by type: Armor - 5%, 1 pc. Weapons - 10%, 1 pc. Artifact - 5%, 1-2 pcs. Consumables - 50%, 1-8 pcs. Cartridges - 25%, 1-6 packs Other - 5%, 1-2 pcs.
ru: Все списки на данной вкладке используются для добавления предметов в тайники и для редактирования ассортимента торговцев. Генерация статов брони и артефактов происходит в файлах outfit.ltx и artefacts.ltx соответственно (директория ./rndata/gamedata/config/misc) и не зависит от данных списков Правила генерации предметов в тайниках. Количество предметов от 1 до 7 (Каждый предмет выбирается случайно и может повторяться) Вероятность генерации предмета по типам: Броня - 5%, 1 шт. Оружие - 10%, 1 шт. Артефакт - 5%, 1-2 шт. Расходник - 50%, 1-8 шт. Патроны - 25%, 1-6 пачек Прочее - 5%, 1-2 шт.

# ItemsTab
source: Items
ru: Предметы

# knifeAtStart
source: Give the player a knife at the beginning of the game
ru: Дать ГГ нож в начале игры

# loadError
source: The following files could not be loaded:
ru: Не удалось загрузить следующие файлы:

source: Load lists
ru: Загрузить списки

# mainFormName
source: Simple randomizer for "S.T.A.L.K.E.R.: Shadow of Chernobyl"
ru: Простой рандомайзер для Тень Чернобыля

# maxThreads
source: Maximum number of threads to process
ru: Максимальное количество потоков для обработки

# modelListTitle
source: Models
ru: Модели

# moreGulag
source: Expand the joining of NPCs to camps (breaks some scripts. It can lead to crashes when playing for a long time, especially on version 1.0006)
ru: Расширить присоединение НПС к лагерям (ломает некоторые скрипты, но сюжетка проходима. Нестабильно на 1.0006)

# moreRespawn
source: Increase the respawn rate of NPCs (may lead to crashes during a long game, especially on version 1.0006)
ru: Увеличить частоту респавна НПС (Нестабильно на 1.0006)

# nameListTitle
source: Names
ru: Имена

# npcDataError
source: Data for the generation of NPCs were not received. An "updateData" call is required
ru: Данные для генерации НПС не были получены. Требуется вызов "updateData"

# npcError
source: NPC generation error. Operation aborted
ru: Ошибка генерации НПС. Операция прервана

# npcGuide
source: Manipulations with NPCs (especially when changing groupings) can increase the probability of a crash Also, when NPC generation is enabled, it is not recommended to go to the rating tab in the PDA List of models: Used to issue a random NPC model. The paths to the models are written from the "gamedata/meshes" folder. There is no need to read and edit the models themselves. To change the available NPC models, it is enough to change the list without copying the model files themselves anywhere Voice acting list: It is used to issue random NPC voice acting. The paths to the voiceover are written from the "gamedata/sounds" folder. Similarly to models, the voice files themselves are not needed for the program to work, just edit the list (if the program is used on top of the mod with additional voice acting). Unlike the paths to the models, here you need to add a backslash to the end of the lines. List of groupings: The names of the groupings can be taken from the file "game_relations.ltx" (not used in this program) or from the files "character_desc_*.xml" List of thumbnails: "Photos" of NPCs shown during dialogues, viewing contacts or searching corpses List of names: Actually, the names of the NPCs. Random names are generated when GENERATE_NAME_[something] is used Checkbox "Use only GENERATE_NAME" disables the use and replacement of special names (quest, etc.) List of exceptions: Not all NPCs can have their properties changed. This list was created for such cases. In the original, for example, you can't touch the Barman and Sidorovich. The main character can be edited, but only the grouping can change there, which is not very convenient, because he is also excluded by default. To add NPCs to exceptions, use the "id" parameter of the "specific_character" tag in the "character_desc_*.xml" files located in ./rndata/gamedata/config/gameplay. Checkboxes near the names of the lists allow you to enable/disable some items in the generation of NPCs
ru: Манипуляции с НПС (особенно при смене группировок) могут увеличить вероятность вылета Также при включеной генерации НПС не рекомендуется заходить во вкладку рейтинга в ПДА Список моделей: Используется для выдачи случайной модели НПС. Пути к моделям прописываются из папки gamedata/meshes. Сами модели считывать и редактировать не надо. Для изменения доступных моделей НПС достаточно изменить список без копирования самих файлов моделей куда-либо Список озвучки: Используется для выдачи случайной озвучки НПС. Пути к озвучке прописываются из папки gamedata/sounds. Аналогично моделям сами файлы озвучки не нужны для работы программы, достаточно просто отредактировать список (если программа используется поверх мода с дополнительной озвучкой). В отличие от путей к моделям здесь нужно добавлять в конец строк обратный слэш. Список группировок: Названия группировок можно взять с файла game_relations.ltx (не используется в данной программе) или с файлов character_desc_*.xml. Тут все понятно Список миниатюр: "Фото" НПС, показываемые во время диалогов, просмотра контактов или обыске трупов Список имен: Собственно, имена НПС. Случайные имена генерируются, когда неписю прописывается GENERATE_NAME_[бла-бла] Пункт "Использовать только GENERATE_NAME" отключает использование и замену особых имен (квестовых и т. п.) Список исключений: Не у всех НПС можно изменять свойства. Для таких случаев и создан этот список. В оригинале, к примеру, трогать нельзя Бармена и Сидоровича. Меченого редачить можно, но там поменяться может только группировка, что не очень удобно, потому он тоже в исключенях по умолчанию. Для добавления НПС в исключения следует использовать параметр id тега specific_character в файлах character_desc_*.xml, расположенных в ./rndata/gamedata/config/gameplay. Галочки около названий списков позволяют включать/отключать некоторые пункты в генерации НПС

# npcRulesError
source: Rules for generating NPCs have not been received. A call to "updateRules" is required
ru: Правила для генерации НПС не были получены. Требуется вызов "updateRules"

# npcTab
source: NPC
ru: НПС

# onePointFourAdvertise
source: The guys from Metacognix write: "The 1.0006 game engine has code changes that cause crashes when weapons, ammo or other items are destroyed while they are still being used..." And "This error can also happen in mods that change ammo and/or weapons" https://www.metacognix.com/stlkrsoc/CrashesStillInTheGame.html The error itself looks like this: sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[36660][bolt: bolt][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21049][wpn_svu: wpn_svu21049][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21048][kolbasa: kolbasa21048][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21047][device_torch: device_torch21047][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21046][bread: bread21046][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21045][ammo_7.62x54_7h1: ammo_7.62x54_7h121045][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21044][device_pda: device_pda21044][137703] sv ownership id_parent[21043][NOTFOUND] id_entity[23538][wpn_eagle_m1: wpn_eagle_m123538][137703] FATAL ERROR [error]Expression: assertion failed [error]Function: xrServer::Process_event_ownership [error]File: E:\stalker\sources\trunk\xr_3da\xrGame\xrServer_process_event_ownership.cpp [error]Line: 23 [error]Description: e_parent stack trace: Scheduler tried to update object mil_freedom_respawn_321043 Since the error is at the engine level, I can't fix it (and in case of correction, this randomizer would be more difficult to run with mods). I tried to find in *.script files something related to the words "parent", "ownership", "assert". But everything I found eventually referred to native C++ code or performed other functions. But the question arises, is editing the numbers in the weapon files considered a sufficient change to cause this error? I suspect not. Most likely, the problem is related to the generation of NPCs. And there are several options here: 1. Generation of NPC weapons. NPCs, as a result of giving them random weapons, much more often begin to pick up weapons from the ground. And as a result of an unsuccessful selection of other weapons offline, the game crashes when the player approaches this unsuccessful NPC 2. Increase in the frequency of respawn of NPCs. More NPCs - more action with weapons. When there are too many NPCs, one of them decides to break everything 3. Expansion of the NPC's joining to the camps. This option also increases the respawn frequency (though not so much), which, coupled with the settlement of unsuitable NPCs in any camps, leads to.. To something there. As a result, someone's weapon loses its owner's id (lol) 4. All of the above If anyone has any ideas on how to fix this, I'm open to suggestions And so I recommend using the 1.0004 version of the game
ru: Если верить парням с Metacognix, то "в игровом движке версии 1.0006 внесены изменения в код, которые приводят к сбоям, когда оружие, боеприпасы или другие предметы уничтожаются во время их использования..." Также ошибка "может возникать в модах, которые изменяют боеприпасы и/или оружие" https://www.metacognix.com/stlkrsoc/CrashesStillInTheGame.html Сама ошибка выглядит так: sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[36660][bolt: bolt][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21049][wpn_svu: wpn_svu21049][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21048][kolbasa: kolbasa21048][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21047][device_torch: device_torch21047][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21046][bread: bread21046][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21045][ammo_7.62x54_7h1: ammo_7.62x54_7h121045][137703] sv reject.id_parent[21043][mil_freedom_respawn_3: mil_freedom_respawn_321043] id_entity[21044][device_pda: device_pda21044][137703] sv ownership id_parent[21043][NOTFOUND] id_entity[23538][wpn_eagle_m1: wpn_eagle_m123538][137703] FATAL ERROR [error]Expression: assertion failed [error]Function: xrServer::Process_event_ownership [error]File: E:\stalker\sources\trunk\xr_3da\xrGame\xrServer_process_event_ownership.cpp [error]Line: 23 [error]Description: e_parent stack trace: Scheduler tried to update object mil_freedom_respawn_321043 Так как ошибка на уровне движка, исправить я ее не смогу (да и в случае исправления, этот рандомайзер было бы сложнее запустить с модами). Я пытался найти в *.script файлах что-то связанное со словами parent, ownership, assert. Но все, что я находил в итоге ссылалось на нативный C++ код или выполняло другие функции. Но возникает вопрос, а правка циферок в файлах оружия считается достаточным изменением для вызова данной ошибки? Не знаю, но подозреваю, что нет. Скорее всего, проблема связана с генерацией НПС. И тут есть как несколько вариантов: 1. Генерация оружия НПС. НПС в результате выдачи им случайного оружия гораздо чаще начинают подбирать оружие с земли. И в результате неудачного подбора другого оружия в офлайне, игра крашится при приближении игрока к этому неудачному НПС 2. Увеличение частоты респавна НПС. Больше НПС - больше действий с оружием. Когда НПС становится слишком много, один из них решает все сломать 3. Расширение присоединения НПС к лагерям. Данная опция также увеличивает частоту респавна (хоть и не так сильно), что вкупе с заселением неподходящих НПС в любые лагеря приводит к... К чему-то там, в общем, что чье-то оружие теряет id своего владельца (лол) 4. Все вышеперечисленное Если у кого есть идеи, как это можно исправить, я открыт к предложениям А так рекомендую пользоваться версией игры 1.0004

# onePointFourLink
source: The 1.0004 version of the game works with this randomizer more stable than 1.0006. But why?
ru: Версия игры 1.0004 работает с этим рандомайзером НАМНОГО стабильнее, чем 1.0006. Но почему?

source: Open
ru: Открыть

# other
source: More...
ru: Другое...

# otherListTitle
source: Other
ru: Прочее

# outfits
source: Armor
ru: Броня

# outfitsDataError
source: The path to save the armor is not specified. An "updateData" call is required
ru: Путь для сохранения брони не указан. Требуется вызов "updateData"

# outfitsError
source: Armor generation error. Operation aborted
ru: Ошибка генерации брони. Операция прервана

# overwritingFiles
source: The following files will be overwritten:
ru: Следующие файлы будут перезаписаны:

source: Processing
ru: Обработка

# rainProbability
source: The probability of rain for each weather class
ru: Вероятность дождя для каждого класса погоды

source: Rank
ru: Ранг

# readHandleError
source: Read or process error
ru: Ошибка чтения или обработки

source: (Recommended)
ru: (Рекомендуется)

# reloadSoundListTitle
source: Sounds of reloading
ru: Звуки перезарядки

source: Reputation
ru: Репутация

# savedIn
source: Saved to the folder:
ru: Сохранено в папку

# saveError
source: The following files could not be saved:
ru: Не удалось сохранить следующие файлы:

# saveFormName
source: Saving
ru: Сохранение

source: Save lists
ru: Сохранить списки

source: Select all
ru: Выбрать все

# shootSoundListTitle
source: Sounds of shooting
ru: Звуки стрельбы

# shuffleText
source: Additionally shuffle the entire text
ru: Дополнительно перемешать весь текст

# skyboxListTitle
source: Sky
ru: Небо

# soundListTitle
source: Voice acting
ru: Озвучка

# soundsError
source: Sound processing error. The operation was aborted
ru: Ошибка обработки звуков. Операция прервана

# soundsPath
source: The path to the sounds folder
ru: Путь к папке sounds

# soundsProcessing
source: Sound processing...
ru: Обработка звука...

# soundsRoundStep
source: The rounding step of the duration of audio files in seconds (using large values at your own risk)
ru: Шаг округления длительности звуковых файлов, сек (использование больших значений на свой страх и риск)

# soundTexturesDescription
source: To shuffle textures and sounds, you need to have unpacked gamedata.db* game files with textures and sounds. The paths to the data folders must be specified in the appropriate fields. The shuffiling process can take a long time, especially if the game files are on the hard drive and not on the SSD. Also, copying mixed textures/sounds will require about 2GB of disk space (for the original game). The maximum number of threads to process sets the number of simultaneously processed directories when reading data from texture/sound files.
ru: Для перемешивания текстур и звуков нужно иметь распакованные игровые файлы gamedata.db* с текстурами и звуками. Пути к папкам с данными нужно указать в соответствующих полях. Процесс перемешивания может занять много времени, особенно если игровые файлы лежат на жестком диске, а не на твердотельном накопителе. Также для копирования перемешанных текстур/звуков потребуется около 2ГБ места на диске (для оригинальной игры). Максимальное количество потоков для обработки устанавливает количество одновременно обрабатываемых директорий при чтени данных с файлов текстур/звуков.

# stepRainSounds
source: Replace the sounds of footsteps and rain (not recommended)
ru: Заменять звуки шагов и дождя (не рекомендуется)

# textDataReadError
source: Error reading game text files
ru: Ошибка чтения файлов с игровым текстом

source: Texture processing...
ru: Обработка текстур...

source: Textures
ru: Текстуры

# texturesError
source: Texture processing error. The operation was aborted
ru: Ошибка обработки текстур. Операция прервана

# texturesPath
source: The path to the textures folder
ru: Путь к папке textures

# thunderListTitle
source: Thunderstorm Effects
ru: Эффекты грозы

# thunderProbability
source: The probability of a thunderstorm for each weather class
ru: Вероятность грозы для каждого класса погоды

# traderDoor
source: Unlock Sidorovich's door
ru: Разблокировать дверь у Сидоровича

# traderItems
source: Merchants' belongings
ru: Вещи торговцев

# tradersDataError
source: The data for generating merchant's belongings were not received. An "updateData" call is required
ru: Данные для генерации вещей торговцев не были получены. Требуется вызов "updateData"

# tradersError
source: Merchants' belongings generation error. Operation aborted
ru: Ошибка генерации вещей торговцев. Операция прервана

# twoWords
source: In a nutshell: I do not know, but...
ru: В двух словах: я не знаю, но...
